#include "includes.h"


/****************************************************
函数名：delay_nns
形参：u16 time time*1ns
返回值：
函数功能：粗延时函数
****************************************************/
void delay_nns(u16 time)
{
	u16 i=0;
	while(time--)
	{
		i=10;
		while(i--);
	}
}

/****************************************************
函数名：delay_nms
形参：u16 time time*1ns
返回值：
函数功能：粗延时函数
****************************************************/
void delay_nms(u16 time)
{
	u16 i;
	while(time--)
	{
		i=12000;//500*12000 MS
		while(i--);
	}
}

